---
kind: enumMember
id: F:Autodesk.Revit.DB.EntryAndSchemeConsistency.ValueOutOfRange
enum: Autodesk.Revit.DB.EntryAndSchemeConsistency
source: html/be67c45f-7c5d-51f6-686d-d33993737f16.htm
---
# Autodesk.Revit.DB.EntryAndSchemeConsistency.ValueOutOfRange

The value stored in the entry is out of the scheme parameter range.